<img src="img/PANDS_V1.png"/>

<div class="alert alert-block alert-info">
<b><span style="font-family:Comic Sans MS">Getting Started with Pandas</span></b>
</div>

__Introduction to pandas Data Structures__

In [4]:
import pandas as pd
ser = pd.Series([4, 7, -5, 3])
print(ser)
print(ser.values)
print(ser.index)

0    4
1    7
2   -5
3    3
dtype: int64
[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [5]:
ser2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print(ser2)
print(ser2.values)
print(ser2.index)

d    4
b    7
a   -5
c    3
dtype: int64
[ 4  7 -5  3]
Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
print(ser2['a'])

-5

In [7]:
print(ser2[ser2 > 0])

d    4
b    7
c    3
dtype: int64

In [11]:
# Few more applications
states_data = {'Ohio': 10000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 9050}
ser2 = pd.Series(states_data)
states = ['California', 'Ohio', 'Oregon', 'Texas']
ser3 = pd.Series(states_data,index=states)
print(ser3)

California        NaN
Ohio          10000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
# Check for null values
pd.isnull(ser3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

__Dealing with DataFrame__

In [14]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2016, 2017, 2018, 2019, 2020, 2021],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame.head()

    state  year  pop
0    Ohio  2016  1.5
1    Ohio  2017  1.7
2    Ohio  2018  3.6
3  Nevada  2019  2.4
4  Nevada  2020  2.9

In [15]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2016    Ohio  1.5
1  2017    Ohio  1.7
2  2018    Ohio  3.6
3  2019  Nevada  2.4
4  2020  Nevada  2.9
5  2021  Nevada  3.2

In [21]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
print(frame2.columns)
print(frame2['state'])
print(frame2.year)
print(frame2.loc['four'])

Index(['year', 'state', 'pop', 'debt'], dtype='object')
one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object
one      2016
two      2017
three    2018
four     2019
five     2020
six      2021
Name: year, dtype: int64
year       2019
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

In [23]:
frame2['returns'] = 16.5
frame2.head()

       year   state  pop debt  returns
one    2016    Ohio  1.5  NaN     16.5
two    2017    Ohio  1.7  NaN     16.5
three  2018    Ohio  3.6  NaN     16.5
four   2019  Nevada  2.4  NaN     16.5
five   2020  Nevada  2.9  NaN     16.5

In [25]:
import numpy as np
frame2['returns'] = np.arange(6.)
frame2.head()

       year   state  pop debt  returns
one    2016    Ohio  1.5  NaN      0.0
two    2017    Ohio  1.7  NaN      1.0
three  2018    Ohio  3.6  NaN      2.0
four   2019  Nevada  2.4  NaN      3.0
five   2020  Nevada  2.9  NaN      4.0

In [26]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2.head()

       year   state  pop  debt  returns
one    2016    Ohio  1.5   NaN      0.0
two    2017    Ohio  1.7  -1.2      1.0
three  2018    Ohio  3.6   NaN      2.0
four   2019  Nevada  2.4  -1.5      3.0
five   2020  Nevada  2.9  -1.7      4.0

In [27]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2.head()

       year   state  pop  debt  returns  eastern
one    2016    Ohio  1.5   NaN      0.0     True
two    2017    Ohio  1.7  -1.2      1.0     True
three  2018    Ohio  3.6   NaN      2.0     True
four   2019  Nevada  2.4  -1.5      3.0    False
five   2020  Nevada  2.9  -1.7      4.0    False

In [28]:
# Delete a column
del frame2['eastern']
print(frame2.columns)

Index(['year', 'state', 'pop', 'debt', 'returns'], dtype='object')

In [30]:
print(frame2.T)
print(frame2.values)

          one   two three    four    five     six
year     2016  2017  2018    2019    2020    2021
state    Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop       1.5   1.7   3.6     2.4     2.9     3.2
debt      NaN  -1.2   NaN    -1.5    -1.7     NaN
returns   0.0   1.0   2.0     3.0     4.0     5.0
[[2016 'Ohio' 1.5 nan 0.0]
 [2017 'Ohio' 1.7 -1.2 1.0]
 [2018 'Ohio' 3.6 nan 2.0]
 [2019 'Nevada' 2.4 -1.5 3.0]
 [2020 'Nevada' 2.9 -1.7 4.0]
 [2021 'Nevada' 3.2 nan 5.0]]

__Reindexing__

In [31]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
print(obj)
print(obj2)

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [32]:
# Another Example
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print(obj3.reindex(range(6), method='ffill'))

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

__Dropping Entries from an Axis__

In [44]:
base = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
print(base)
new_base = base.drop('c')
print(new_base)
print(base.drop(['d', 'c']))

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64
a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64
a    0.0
b    1.0
e    4.0
dtype: float64

In [35]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data.head()

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [38]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [45]:
base.drop('c', inplace=True)
base

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

__Indexing, Selection, and Filtering__

In [51]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj['b'])
print(obj[1])
print(obj[2:4])
print(obj[['b', 'a', 'd']])
print(obj[obj < 2])
print(obj[[1, 3]])
print(obj['b':'c'] == 5)

1.0
1.0
c    2.0
d    3.0
dtype: float64
b    1.0
a    0.0
d    3.0
dtype: float64
a    0.0
b    1.0
dtype: float64
b    1.0
d    3.0
dtype: float64
b    False
c    False
dtype: bool

In [52]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
print(data['four'])
print(data[['three', 'one']])
print(data[:2])
print(data[data['three'] > 5])

Ohio         3
Colorado     7
Utah        11
New York    15
Name: four, dtype: int64
          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

__Selection with loc and iloc__

In [54]:
print(data.loc['Colorado', ['two', 'three']])
print(data.iloc[2, [3, 0, 1]])
print(data.iloc[[1, 2], [3, 0, 1]])
print(data.iloc[:, :3][data.three > 5])

two      5
three    6
Name: Colorado, dtype: int64
four    11
one      8
two      9
Name: Utah, dtype: int64
          four  one  two
Colorado     7    4    5
Utah        11    8    9
          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

__Arithmetic methods with fill values__

In [55]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

In [56]:
df1.head()

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [57]:
df2.head()

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [58]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [59]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [60]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [61]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [62]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

__Examples of Function Application and Mapping__

In [63]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame.head()

               b         d         e
Utah    0.067334  0.149927  0.659851
Ohio   -0.013621  1.296075  0.382963
Texas  -0.092813  1.502437  0.523044
Oregon -1.229943  1.572417 -0.548259

In [64]:
np.abs(frame)

               b         d         e
Utah    0.067334  0.149927  0.659851
Ohio    0.013621  1.296075  0.382963
Texas   0.092813  1.502437  0.523044
Oregon  1.229943  1.572417  0.548259

In [65]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.297277
d    1.422490
e    1.208110
dtype: float64

In [66]:
frame.apply(f, axis='columns')

Utah      0.592517
Ohio      1.309697
Texas     1.595250
Oregon    2.802360
dtype: float64

__Custom Functions__

In [67]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.229943  0.149927 -0.548259
max  0.067334  1.572417  0.659851

In [68]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah     0.07  0.15   0.66
Ohio    -0.01  1.30   0.38
Texas   -0.09  1.50   0.52
Oregon  -1.23  1.57  -0.55

In [69]:
frame['e'].map(format)

Utah       0.66
Ohio       0.38
Texas      0.52
Oregon    -0.55
Name: e, dtype: object

__Sorting and Ranking__

In [70]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [74]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
print(frame.sort_index())
print(frame.sort_index(axis=1))
print(frame.sort_index(axis=1, ascending=False))

       d  a  b  c
one    4  5  6  7
three  0  1  2  3
       a  b  c  d
three  1  2  3  0
one    5  6  7  4
       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [75]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
print(frame)
print(frame.sort_values(by='b'))
print(frame.sort_values(by=['a', 'b']))

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1
   b  a
2 -3  0
3  2  1
0  4  0
1  7  1
   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [79]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
print(obj.rank())
print(obj.rank(method='first'))
# Assign tie values the maximum rank in the group
print(obj.rank(ascending=False, method='max'))

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64
0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [80]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame.head()

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [81]:
print(frame.rank(axis='columns'))

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

__Axis Indexes with Duplicate Labels__

In [82]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
print(obj)
print(obj.index.is_unique)

a    0
a    1
b    2
b    3
c    4
dtype: int64
False

__Correlation and Covariance__

In [84]:
# !pip install pandas-datareader

In [85]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG', 'AMZN']}
price = pd.DataFrame({ticker: data['Adj Close'] 
                      for ticker , data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] 
                       for ticker, data in all_data.items()})

In [86]:
returns = price.pct_change()

In [87]:
returns.tail()

                AAPL       IBM      MSFT      GOOG      AMZN
Date
2021-03-22  0.028336  0.012801  0.024484 -0.002256  0.011678
2021-03-23 -0.006889 -0.000689  0.006738  0.007049  0.008560
2021-03-24 -0.019994  0.001226 -0.008923 -0.003848 -0.016073
2021-03-25  0.004164  0.018757 -0.013251 -0.000342 -0.013220
2021-03-26  0.005141  0.024874  0.017819 -0.004309  0.001894

In [89]:
print(returns['MSFT'].corr(returns['IBM']))
print(returns['MSFT'].cov(returns['IBM']))
print(returns.MSFT.corr(returns.IBM))

0.532328075272984
0.00015131267350116837
0.532328075272984

In [90]:
returns.corr()

          AAPL       IBM      MSFT      GOOG      AMZN
AAPL  1.000000  0.446699  0.712522  0.651014  0.614105
IBM   0.446699  1.000000  0.532328  0.499006  0.358721
MSFT  0.712522  0.532328  1.000000  0.778047  0.705894
GOOG  0.651014  0.499006  0.778047  1.000000  0.666460
AMZN  0.614105  0.358721  0.705894  0.666460  1.000000

In [91]:
returns.cov()

          AAPL       IBM      MSFT      GOOG      AMZN
AAPL  0.000365  0.000140  0.000236  0.000209  0.000218
IBM   0.000140  0.000268  0.000151  0.000137  0.000109
MSFT  0.000236  0.000151  0.000301  0.000226  0.000227
GOOG  0.000209  0.000137  0.000226  0.000281  0.000207
AMZN  0.000218  0.000109  0.000227  0.000207  0.000344

In [93]:
print(returns.corrwith(returns.IBM))

AAPL    0.446699
IBM     1.000000
MSFT    0.532328
GOOG    0.499006
AMZN    0.358721
dtype: float64

In [94]:
print(returns.corrwith(volume))

AAPL   -0.073958
IBM    -0.114434
MSFT   -0.085121
GOOG   -0.134136
AMZN   -0.030239
dtype: float64

__Unique Values, Value Counts__

In [95]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
print(uniques)
print(obj.value_counts())
print(pd.value_counts(obj.values, sort=False))

['c' 'a' 'd' 'b']
a    3
c    3
b    2
d    1
dtype: int64
a    3
c    3
d    1
b    2
dtype: int64

In [96]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
print(pd.Index(unique_vals).get_indexer(to_match))

[0 2 1 1 0 2]

__Example of OOP__

In [105]:
# Objects in Python
class PersonDetail():
    def __init__(self, name, age, address):
        self.name = name
        self.age = age
        self.address = address
        

if __name__ == "__main__":
    p = Person("Shovon", 36, 'XYZ lane, Bangalore-500000')
    print(p.name)
    print(p.age)
    print(p.address)

Shovon
36
XYZ lane, Bangalore-500000

__Example of 'for' loop__

In [97]:
def isPhoneN(text):
    if len(text) != 12:
        return False
    for i in range(0,3):
        if not text[i].isdecimal():
            return False
    if text[3] != '-':
        return False
    for i in range(4,7):
        if not text[i].isdecimal():
            return False
    if text[7] != '-':
        return False
    for i in range(8, 12):
        if not text[i].isdecimal():
            return False
    return True

In [102]:
print('100-200-4242 is a phone number:')
print(isPhoneN('100-200-4242'))
print('Hello World of Python is a phone number:')
print(isPhoneN('Hello World of Python'))

100-200-4242 is a phone number:
True
Hello World of Python is a phone number:
False

In [103]:
message = 'Call me at 100-200-0000 tomorrow. 415-555-6666 is my office.'
for i in range(len(message)):
    chunk = message[i:i+12]
    if isPhoneN(chunk):
        print('Phone number found: ' + chunk)
print('Done')

Phone number found: 100-200-0000
Phone number found: 415-555-6666
Done